rails-folder/app/controllers/boards_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "scott@s.com"], ["LIMIT", 1]]
INSERT INTO "user_boards" ("user_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["board_id", 4], ["created_at", 2016-12-08 02:58:17 UTC], ["updated_at", 2016-12-08 02:58:17 UTC]]
SELECT "boards".* FROM "boards" INNER JOIN "user_boards" ON "boards"."id" = "user_boards"."board_id" WHERE "user_boards"."user_id" = $1  [["user_id", 2]]
SELECT "users".* FROM "users"
---
  def create
    board = Board.new(title: params[:title])
    user = User.find(params[:user_id])
    other_user_email = params[:other_user_email]
    other_user = User.find_by(email: other_user_email)

    if board.save
      user_board_one = UserBoard.create(user_id: user.id, board_id: board.id)
      user_board_two = UserBoard.create(user_id: other_user.id, board_id: board.id)
    end

    new_user_boards = user.boards.map do |board|

SELECT  "user_boards".* FROM "user_boards" WHERE "user_boards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "boards".* FROM "boards"
SELECT "posts".* FROM "posts" WHERE "posts"."user_board_id" = $1  [["user_board_id", 3]]
SELECT "users".* FROM "users" INNER JOIN "user_boards" ON "users"."id" = "user_boards"."user_id" WHERE "user_boards"."board_id" = $1  [["board_id", 1]]
INSERT INTO "posts" ("content", "user_board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Hey Drew. Hope you're well."], ["user_board_id", 3], ["created_at", 2016-12-03 18:55:21 UTC], ["updated_at", 2016-12-03 18:55:21 UTC]]
INSERT INTO "user_boards" ("user_id", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["board_id", 2], ["created_at", 2016-12-03 18:55:21 UTC], ["updated_at", 2016-12-03 18:55:21 UTC]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Scott"], ["email", "scott@s.com"], ["password_digest", "scott0"], ["created_at", 2016-12-03 18:55:21 UTC], ["updated_at", 2016-12-03 18:55:21 UTC]]
---
  def show
    # tried ordering when pulling from DB, difficult because selection will be two arrays from users
    board = Board.find(params[:id])
    users = board.users

    rawPosts = board.user_boards.map {|user_board| user_board.posts}.flatten

    # [{Post}, {}, {}]
    order_posts = rawPosts.sort_by {|post| post.created_at}.reverse

SELECT "user_boards".* FROM "user_boards" WHERE "user_boards"."board_id" = $1  [["board_id", 2]]
UPDATE "boards" SET "title" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["title", "Soctt & Drew: yayyyy"], ["updated_at", 2016-12-09 16:45:09 UTC], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_board_id" = $1  [["user_board_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_boards" ON "users"."id" = "user_boards"."user_id" WHERE "user_boards"."board_id" = $1  [["board_id", 2]]
SELECT "boards".* FROM "boards" INNER JOIN "user_boards" ON "boards"."id" = "user_boards"."board_id" WHERE "user_boards"."user_id" = $1  [["user_id", 2]]
---
  def update
    board = Board.find(params[:board_id])
    board.update(title: params[:title])
    current_user = User.find(params[:current_user_id])

    users = board.users
    rawPosts = board.user_boards.map {|user_board| user_board.posts}.flatten

    # [{Post}, {}, {}]
    order_posts = rawPosts.sort_by {|post| post.created_at}.reverse
    orderedWithUser = order_posts.map {|post| {id: post.id, content: post.content, userID: post.user_board.user.id, userName: post.user_board.user.name}}
    users = board.users.map {|user| {id: user.id, name: user.name}}

    sorted_boards = current_user.boards.sort_by &:created_at

    user_boards = sorted_boards.map do |board|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]
SELECT "boards".* FROM "boards" INNER JOIN "user_boards" ON "boards"."id" = "user_boards"."board_id" WHERE "user_boards"."user_id" = $1  [["user_id", 2]]
---
  def destroy
    @user = User.find(params[:user_id])
    @board = Board.find(params[:id])
    @board.destroy
    new_boards = @user.boards.map do |board|