rails-folder/app/controllers/images_controller.rb

  def create
    image = Image.new(image_params)

    if image.save
      board = Board.find(image.user_board.board.id)
---
INSERT INTO "images" ("url", "user_board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT  "user_boards".* FROM "user_boards" WHERE "user_boards"."board_id" = $1 ORDER BY "user_boards"."id" DESC LIMIT $2  [["board_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE "images"."user_board_id" = $1  [["user_board_id", 4]]

  def destroy
    board = Board.find(image_params[:board_id])
    Image.delete(params[:id])
    rawImages = board.user_boards.map {|user_board| user_board.images}.flatten
---
SELECT "user_boards".* FROM "user_boards" WHERE "user_boards"."board_id" = $1  [["board_id", 1]]
DELETE FROM "images" WHERE "images"."id" = $1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "images".* FROM "images" WHERE "images"."user_board_id" = $1  [["user_board_id", 3]]