rails-folder/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "hello world"], ["user_board_id", 3], ["created_at", 2016-12-03 22:36:32 UTC], ["updated_at", 2016-12-03 22:36:32 UTC]]
SELECT  "user_boards".* FROM "user_boards" WHERE "user_boards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "boards".* FROM "boards" ORDER BY "boards"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_board_id" = $1  [["user_board_id", 3]]
SELECT "users".* FROM "users" INNER JOIN "user_boards" ON "users"."id" = "user_boards"."user_id" WHERE "user_boards"."board_id" = $1  [["board_id", 1]]
---
  def create
    post = Post.new(post_params)
    if post.save
      board = Board.find(UserBoard.find(post_params[:user_board_id]).board.id)
      rawPosts = board.user_boards.map {|user_board| user_board.posts}.flatten

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "user_boards".* FROM "user_boards" WHERE "user_boards"."board_id" = $1  [["board_id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 26]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_board_id" = $1  [["user_board_id", 3]]
---
  def destroy
    post = Post.find(post_params[:id])
    board = Board.find(post_params[:board_id])

    Post.delete(params[:id])

    rawPosts = board.user_boards.map {|user_board| user_board.posts}.flatten