rails-folder/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: auth_params[:email])
    if user.authenticate(auth_params[:password])
      jwt = Auth.issue({user: user.id})
      sorted_boards = user.boards.sort_by &:created_at
      boards = sorted_boards.map do |board|
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "a@a.com"], ["LIMIT", 1]]
SELECT "boards".* FROM "boards" INNER JOIN "user_boards" ON "boards"."id" = "user_boards"."board_id" WHERE "user_boards"."user_id" = $1  [["user_id", 2]]