rails-folder/app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    user.update(name: params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Droo"], ["updated_at", 2016-12-13 14:43:53 UTC], ["id", 2]]

  def destroy
    user = User.find(params[:user_id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]